# Фрагмент A
# Причина ошибки - Оператор + при работе со строковыми типом данных совершает конкатенацию, как бы склеивая строки
# Решение - Либо изначально использовать тип данных int, либо приводить к нему
first = "2"
second = "3"
print(int(first) + int(second))
# Фрагмент B
# Причина ошибки - Переменна age является типом данных string, в выводе используется оператор + с int
# Решение - получать изначально тип данных int или конвертировать его в выводе. Использую первый вариант
age = int(input("Возраст: "))
print(age + 1)
# Фрагмент C
# Причина ошибки - Оператор / имеет приоритет перед операторами +, поэтому выполняется сначала выражение third / 3
# Решение - Обернуть все выражения с оператором + в скобки, чтобы они имели приоритет выполения выше, чем у оператора /
first = 4
second = 7
third = 10
average = (first + second + third) / 3
print(average)